{
  "link": "https://tecnoblog.net/320777/warner-bros-usara-inteligencia-artificial-decidir-filmes-aprovar/",
  "title": "Warner Bros usará inteligência artificial para decidir quais filmes aprovar",
  "thumb": "https://tecnoblog.net/wp-content/uploads/2020/01/warner-bros-700x394.jpg",
  "contents": [
    {
      "type": "text",
      "content": "A Warner Bros, responsável por sucessos como Coringa, assinou um acordo com a startup Cinelytic para usar a inteligência artificial no processo de aprovação de filmes do estúdio. Apesar de não tomar a decisão final, a tecnologia economizará mão de obra de funcionários e tempo do estúdio para dar o \"sinal verde\" de uma produção."
    },
    {
      "type": "text-highlighted",
      "content": "Como a Warner Bros pretende usar IA"
    },
    {
      "type": "text",
      "content": "A Cinelytic é uma startup fundada há quatro anos e que teve a ferramenta de análise em beta por três anos. Foi em 2019 que o sistema — o qual pode fornecer dados sobre elenco, aquisições e até data de lançamento da produção — teve seu lançamento oficial."
    },
    {
      "type": "image",
      "content": "https://tecnoblog.net/wp-content/uploads/2020/01/warner-bros-700x394.jpg"
    },
    {
      "type": "text",
      "content": "Com o acordo, a Warner Bros terá ajuda da inteligência artificial para prever receita, gastos e até quando o filme deveria ser lançado. A decisão final ainda seria de executivos do estúdio, porém a tecnologia da Cinelytic economizaria tempo ao reduzir mão de obra com trabalhos repetitivos, agindo como um filtro responsável pelo \"sinal verde\"."
    },
    {
      "type": "text",
      "content": "Tobias Queisser, um dos fundadores e CEO da startup, disse ao Hollywood Reporter que a ferramenta pode calcular em segundos uma avaliação geral de filmes ou o valor de uma estrela; o que levaria dias por um humano."
    },
    {
      "type": "text",
      "content": "Apesar disso, o próprio Queisser afirma que a IA não substituirá os humanos quando se trata de criatividade: \"Inteligência artificial é boa para analisar números, mostrar conjuntos de dados e padrões não visíveis aos humanos. Mas, para a tomada criativa de decisões, você ainda precisa de experiência e extinto\"."
    },
    {
      "type": "text",
      "content": "Na cartela de clientes da Cinelytic também estão a T&B Media Global — contrato que rendeu US$ 2,5 milhões para a startup —, Ingenious Media (Avatar), Productivity Media (The Little Hours) e mais recentemente a STX (Perfeita é a Mãe 2)."
    },
    {
      "type": "text",
      "content": "Em especial, a IA da Cinelytic pode vir a ser útil em festivais, quando os estúdios precisam dar grandes ofertas em produções, num curto espaço de tempo para analisá-los. Um exemplo: a New Line gastou US$ 15 milhões com o filme A Música da Minha Vida no Festival Sundance de Cinema do ano passado."
    },
    {
      "type": "text",
      "content": "A Cinelytic não pode garantir sucessos de US$ 1 bilhão como foi Coringa. Entretanto, com certeza ajudará a não desperdiçar esforços da Warner Bros e tempo dos espectadores com filmes como Rainhas do Crime, o qual recebeu nota 35 no Metacritic."
    },
    {
      "type": "text",
      "content": "Com informações: The Holywood Reporter, CNET, Engadget."
    }
  ]
}